Repository: indiegabo/iht-docs
Catalog: locales/*/LC_MESSAGES/index.po
Languages: pt_br

source: First Steps
pt_br: Primeiros Passos

source: Available Features
pt_br: Ferramentas Disponíveis

source: IndieGabo's Handy Tools!
pt_br: Handy Tools do IndieGabo!

source: Welcome to IndieGabo's Handy Tools! Hurray!
pt_br: Boas vindas ao IndieGabo's Handy Tools

source: Installation
pt_br: Instalando

source: :ref:`Check out how to install it <installation-page>`.
pt_br: :ref:`Veja como instalar <installation-page>`.

source: Contribute
pt_br: Contribua

source: Donate something <3
pt_br: Se puder, doe algo <3

source: Where to Find IndieGabo
pt_br: Onde achar o IndieGabo

source: This package uses ``NaughtyAttributes`` in order to keep its inspector more pleasant. Huge thanks to ``dbrizov`` for this incredible tool. You can check it out on `NaughtyAttributes Github <https://dbrizov.github.io/na-docs/>`_ .
pt_br: Esse pacote utiliza ``NaughtyAttributes`` para manter o inspetor mais amigável muito obrigado ``dbrizov`` por essa ferramenta maravilhosa. Você pode saber `Github do NaughtyAttributes <https://dbrizov.github.io/na-docs/>`_ .

source: Gabinho Waving
pt_br: Gabinho Acenando
