Repository: indiegabo/iht-docs
Catalog: sphinx/source/locales/*/LC_MESSAGES/index.po
Languages: pt_br

source: First Steps
pt_br: Primeiros Passos

source: Available Features
pt_br: Ferramentas Disponíveis

source: IndieGabo's Handy Tools!
pt_br: Utilidades do IndieGabo!

source: Welcome to IndieGabo's Handy Tools documentation! Hurray! \\o/
pt_br: Boas vindas à documentação das Utilidades do IndieGabo! Aeeeeeeee! \o/

source: About this project
pt_br: Sobre o projeto

source: This is a collection of handy tools for Unity Game developers. Specially 2D driven ones.
pt_br: Esta é uma coleção de ferramentas úteis para desenvolvedores de jogos que usam a Unity. Principalmente para os desenvolvedores 2D.

source: My goal is to make easy to use and iterative components so you can either use them as they are or have a starting point to create something awesome for your game.
pt_br: O meu objetivo é fazer ferramentas fáceis de usar e iterativas, para que você possa usá-las como estão ou ter um ponto de partida para criar algo maravilhoso para seu jogo.

source: Current Version
pt_br: Versão atual

source: This is a beta test version. I am currently working on a CharacterController2D and i believe that as soon as it is finished, we can call the package stable enough to get an 1.0.0 version.
pt_br: Esta é uma versão beta. Estou trabalhando no CharacterController2D e creio que assim que ele for finalizado, poderemos lançar um pacote com uma versão 1.0.0 estável.

source: Currently Working On
pt_br: O trampo atual

source: I am currently working on the :ref:`CharacterController2D <welcome-character-controller-2d-page>`. Finishing some movement stuff like crounching and ledge grabing and looking forward to add some attacks into it.
pt_br: :ref:`CharacterController2D <welcome-character-controller-2d-page>`. Finalizando alguns aspectos de movimentação, como agachar e poder agarrar em quinas. O próximo passo vai ser adicionar algumas maneiras de atacar.

source: Itch Store
pt_br: Loja na Itch

source: I use these tools to build assets and distribute them on itch.io. It is a way for me to give something worth of your support so i can keep creating stuff. Feel free to browse my `itch page <https://indiegabo.itch.io>`_ and find something usefull to you there.
pt_br: Eu uso estas ferramentas para criar assets e distribuí-las no itch.io. É uma forma deu entregar algo que que faça o seu apoio valer a pena. Assim eu posso continuar criando coisas e sonhar. Sinta-se a vontade para navegar na minha `página da itch <https://indiegabo.itch.io>`_ e encontrar algo útil para você lá.

source: I try creating fuylly functional assets.
pt_br: Eu tento criar assets completamente funcionais e fáceis de adapatar.

source: Contribute
pt_br: Contribua

source: If you want to contribute to this project, get in touch by any of my socials listed below.
pt_br: Se você quiser contribuir com este projeto, entre em contato comigo em qualquer uma das minhas redes sociais listadas abaixo.

source: Do not forget to at least consider joining my `patreon <https://patreon.com/indiegabo>`_ to own assets i distribute in itch.io. In other words: you will be able to download my itch payed assets without having to spend any other money besides your patreon subscription.
pt_br: Não se esqueça de considerar se juntar ao meu `patreon <https://patreon.com/indiegabo>`_ para ter acesso aos assets pagos na itch.io. Em outras palavras: você poderá baixar os assets pagos da minha itch.io sem precisar gastar nada além da sua assinatura no patreon.

source: Nevertheless, if somehow you just want to donate cause you find my work useful, click the button below:
pt_br: No entanto, se você quiser apenas doar pois acha meu trabalho útil, clique no botão abaixo:

source: Where to Find IndieGabo
pt_br: Onde achar o IndieGabo

source: Checkout this and other projects on my `Github page <https://github.com/indiegabo/>`_ .
pt_br: Veja este e outros projetos na minha `página do Github <https://github.com/indiegabo/>`_ .

source: I use my `Youtube channel <https://youtube.com/c/indiegabooficial/>`_ to post tutorials and insights.
pt_br: Eu uso meu `canal do Youtube <https://youtube.com/c/indiegabooficial/>`_ para postar tutoriais e insights.

source: You can hang out with me while i stream on my `Twitch Channel <https://twitch.tv/indiegabo>`_.
pt_br: Você pode bater um papo comigo enquanto eu estou streamando no meu `canal da Twitch <https://twitch.tv/indiegabo>`_.

source: Follow me `@indiegabo <https://instagram.com/indiegabo>`_ on my Instagram to get in touch with me on daily basis.
pt_br: Siga `@indiegabo <https://instagram.com/indiegabo>`_ no Instagram para entrar em contato comigo no dia-a-dia.

source: Gabinho Waving
pt_br: Gabinho Acenando
