Repository: indiegabo/iht-docs
Catalog: sphinx/source/locales/*/LC_MESSAGES/fsm/how-to-use/parent-states.po
Languages: pt_br

source: Parent States
pt_br: Estados Base

source: Wait a minute... parents?
pt_br: Pera, Base?

source: Yes! Parents!
pt_br: Sim! Estados Base!!

source: You can create a state wich holds the same group of properties and functionalities for several other child states.
pt_br: Você pode criar um estado que possui as mesmas propriedades e funcionalidades para compartilhar com vários outros estados filhos.

source: Say you understand that some actor of yours has several states wich can transition into the same other states. Or share a single or even a group of properties. You can create a parent state and then create child states that inherit from that. Like the following example:
pt_br: Digamos que você entende que algum ator de seu joguinho possui vários estados que podem transitar para os mesmos estados. Ou compartilhar algumas propriedades. Você pode criar um estado base e então criar estados filhos que herdam do mesmo. Como o exemplo abaixo:

source: First, create a parent state:
pt_br: Primeiro, crie um estado base:

source: Now we can create a GroundedState wich will inherit all those transitions:
pt_br: Agora, podemos criar um GroundedState que herdará todas essas transições:

source: But say you need to register new transitions for your child state:
pt_br: Mas digamos que você precisa registrar novas transições para seu estado filho:

source: For me personally i find this quite handy. Tons of code can be avoided and you keep your project organized.
pt_br: Pessoalmente, eu acho isso muito útil. Evita muita codificação e mantém as coisas organizadas.

source: Gabinho Waving
pt_br: Gabino Acenando
