Repository: indiegabo/iht-docs
Catalog: locales/*/LC_MESSAGES/fsm/how-to-use/creating-states-for-an-actor.po
Languages: pt_br

source: Creating States for an Actor
pt_br: Criando Estados para um Ator

source: What is a state?
pt_br: O que é um estado?

source: A state represents a specific group of actions that should be performed while an actor's specific condition is met.
pt_br: Um estado representa um grupo de ações que devem ser executadas enquanto uma condição específica do ator é atendida.

source: The usage strategy
pt_br: A estratégia de uso

source: After being correctly crafted, a :ref:`State <state-class>` script should be attached to the same GameObject as the :ref:`StateMachine <state-machine-class>`. The machine will then automatically recognize it and use it as it should.
pt_br: Após ser corretamente criado, um script de :ref:`Estado <state-class>` deve ser anexado ao mesmo GameObject da :ref:`StateMachine <state-machine-class>`. A máquina automaticamente irá reconhecer o estado usa-lodevidamente.

source: Also, the :ref:`State <state-class>` class, as the :ref:`Actor <actor-class>` class, is abstract. It is so because a state is specific for an specific actor. Being that way, it does not make any sense to a state to exist without knowing its reason for being.
pt_br: Além disso, a classe :ref:`State <state-class>` é abstrata, assim como a classe :ref:`Actor <actor-class>`. Porque um estado é específico para um ator específico. Sendo assim, não faz sentidoque um estado exista sem que se saiba porquê ele está sendo criado.

source: The code
pt_br: O Código

source: Below is the base code for a successful state. Take a look at it and feel free to copy and use it as you wish.
pt_br: Abaixo está o código base para um estado bem sucedido. Dê uma olhada nele e sinta-se livre para copiar e usar como quiser.

source: And, of course, there is a Script Template ready for you at *Create* ``->`` *IndieGabo* ``->`` *FSM* ``->`` *New State*.
pt_br: E, claro, há um Modelo de Script pronto para você em *Create* ``->`` *IndieGabo* ``->`` *FSM* ``->`` *New State*.

source: Ok. Now that we've seen the code, let's take a deep dive into each of those methods. All these methods are optional and you only need to implement the ones you will use inside your state.
pt_br: Ok. Agora que vimos o código, vamos dar uma olhada em cada um de seus métodos. Todos eles são opcionais e você só precisa implementar os que você vai usar dentro do seu estado.

source: This method represents the moment a :ref:`StateMachine <state-machine-class>` loads this :ref:`State <state-class>` script into its handled states. So it is inside the ``State.OnLoad()`` that you should put any logic regardind initialization **before** the machine starts running.
pt_br: Este método representa o momento em que a :ref:`StateMachine <state-machine-class>` carrega este script de :ref:`State <state-class>` como um de seus estados. Então, é no ``State.OnLoad()`` que você deve colocar qualquer lógica que seja necessária para inicialização **antes** que a máquina comece a rodar.

source: The ``State.OnLoad()`` is the best place to register transitions. Wich we will cover on the :ref:`Transitioning Between States <transitioning-between-states>` section.
pt_br: O ``State.OnLoad()`` é o melhor lugar para registrar transições. Vamos dar uma olhada melhor em transições na seção :ref:`Transitando entre estados <transitioning-between-states>`.

source: This method is called only once in the :ref:`StateMachine <state-machine-class>` life cycle.
pt_br: Este método é chamado apenas uma vez no ciclo de vida da :ref:`StateMachine <state-machine-class>`.

source: This method is called the **exact moment** a :ref:`StateMachine <state-machine-class>` sets this :ref:`State <state-class>` script as its current state.
pt_br: Este método é chamado o **momento exato** que a :ref:`StateMachine <state-machine-class>` define este script de :ref:`State <state-class>` como seu estado atual.

source: The ``State.OnEnter()`` is perfect for start playing animations, initializing variables, properties and etc.
pt_br: O ``State.OnEnter()`` é o melhor lugar para iniciar animações, inicializar variáveis, propriedades e etc.

source: This method is called **right before** a :ref:`StateMachine <state-machine-class>` wich has this :ref:`State <state-class>` script as its current state, transition into another state.
pt_br: Este método é chamado **exatamente antes** que a :ref:`StateMachine <state-machine-class>` que tem este script de :ref:`State <state-class>` como seu estado atual, transite para outro estado.

source: The ``State.OnExit()`` is perfect place to stop animations and reset variables, properties and etc.
pt_br: O ``State.OnExit()`` é o melhor lugar para parar animações e resetar variáveis, propriedades e etc.

source: Once a State is defined as current state by the machine, its "Ticker methods" will be called at each time its actor "frame handlers" are executed.
pt_br: Uma vez que um estado é definido como estado atual pela máquina, seus métodos "Ticker" serão chamados toda vez que os "Frame Handlers" do ator são executados.

source: They are:
pt_br: São eles:

source: ``Tick()``: Called every time the actor `Update() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.Update.html>`_ method is called.
pt_br: ``Tick()``: Chamado toda vez que o método `Update() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.Update.html>`_ do ator é chamado.

source: ``LateTick()``: Called every time the actor `LateUpdate() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.LateUpdate.html>`_ method is called.
pt_br: ``LateTick()``: Chamado toda vez que o método `LateUpdate() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.LateUpdate.html>`_ do ator é chamado.

source: ``FixedTick()``: Called every time the actor `FixedUpdate() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.FixedUpdate.html>`_ method is called.
pt_br: ``FixedTick()``: Chamado toda vez que o método `FixedUpdate() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.FixedUpdate.html>`_ do ator é chamado.

source: If you are not familiar with the `LateUpdate() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.LateUpdate.html>`_ method, it is called once per frame after the `Update() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.Update.html>`_ as a way to organize your script execution.
pt_br: Se você não está familiarizado com o método `LateUpdate() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.LateUpdate.html>`_, ele é chamado uma vez por frame após o `Update() <https://docs.unity3d.com/ScriptReference/MonoBehaviour.Update.html>`_

source: Refer to the :ref:`IndieGabo's FSM Life Cycle <lifecycle>` for visual information about Tickers being called.
pt_br: Veja o :ref:`ciclo de vida da FSM <lifecycle>` para informações visuais sobre os Tickers chamados.

source: Transitioning Between States
pt_br: Transitando entre estados

source: There are two ways for a state to transition into another state:
pt_br: Existem duas maneiras de um estado transitar para outro estado:

source: By calling the Machine's ``ChangeState()`` method.
pt_br: Chamando o método ``ChangeState()`` da Máquina.

source: As seen on the :ref:`State Documentation <state-class>`, all the states hold reference to the Machine they belong to. Therefore, accessing the machine's methods from within a state is as easy as using its ``State.machine`` property as we can see below.
pt_br: Como visto na :ref:`Documentação do Estado <state-class>`, todos os estados guardam referência à Máquina que eles pertencem. Portanto, acessar os métodos e propriedades da Máquina de dentro de um estado é fácil como acessar a propriedade ``State.machine``.

source: By registering a :ref:`StateTransition <state-transition-class>` inside its ``State.OnLoad()`` using the ``State.AddTransition()`` method.
pt_br: Registrando uma :ref:`StateTransition <state-transition-class>` dentro de seu ``State.OnLoad()`` usando o método ``State.AddTransition()``.

source: Using this approach (wich is highly recommended) the machine will, at each of the "frame handlers", evaluate if any condition is met considering given priorities. If so, it will automatically transition into the target state.
pt_br: Usando esta abordagem (que é altamente recomendada) a máquina, em cada "Frame Handler" do ator, avaliará se alguma condição de suas ```transitions`` é cumprida, considerando suas prioridades. Caso alguma seja avaliada como verdade, ele irá automaticamente transitar para o estado alvo da ``StateTransition``.

source: A :ref:`StateTransition <state-transition-class>` consists in a ``Condition``, a target ``State`` and a ``priotity`` level. But there is no need for you to instantiate it. Just call the ``State.AddTransition()`` method and pass the those 3 arguments. I take care of the rest for you. Here is how you use it:
pt_br: A :ref:`StateTransition <state-transition-class>` consiste em uma ``Condition``, um ``State`` alvo e uma ``prioridade``. Mas não é necessário que você instancie ela. Só chame o método ``State.AddTransition()`` e passe os 3 argumentos. Eu cuido do resto por você. Aqui está como você usa:

source: But, if you somehow prefer, here is how a StateTransition is instantiated and registered:
pt_br: Mas, se você quiser, aqui está como uma StateTransition é instanciada e registrada:

source: Note that to declare a ``Condition`` you **MUST** approach using a `Func<TResult> Delegate <https://docs.microsoft.com/en-us/dotnet/api/system.func-1?view=net-6.0>`_. Do not worry if you are not familiar with this yet. All you need to know is that the machine will call this as a method (function) and its context will be evaluated as true or false only when the machine do so. In case this represents news for you, for now, just follow the syntax in the code below each time you want to register a :ref:`StateTransition <state-transition-class>` in a state.
pt_br: Note que para declarar uma ``Condition`` você **DEVE** proceder usando um `Func<TResult> Delegar <https://docs.microsoft.com/pt-br/dotnet/api/system.func-1?view=net-6.0>`_. Não se preocupe se você não está familiarizado com isso ainda. Tudo que você precisa saber é que a máquina irá chamar essa ``Condition()`` como um método (função) e seu contexto será avaliado como verdadeiro ou falso somente quando a máquina assim o fizer. No caso disso ser novidade para você, por enquanto, apenas siga a sintaxe no código abaixo cada vez que você quiser registrar uma :ref:`StateTransition <state-transition-class>` em um estado.

source: To declare the target state, since all states are components attached to the same GameObject, you can just use the ``GetComponent<State>()`` method.
pt_br: Para declarar o estado alvo, já que todos os estados são componentes anexados ao mesmo GameObject, você pode simplesmente usar o método ``GetComponent<State>()``.

source: At last, priority for the machine is read **descending**. Wich means the higher the integer you give as third argument, sooner its condition will be evaluated. otherwise it will be read as the declaration order. The default priority value is ``0``.
pt_br: Por último, a prioridade da máquina é lida de maneira **descendente**. O que significa que a maior prioridade que você dá como terceiro argumento, fará com que a ``Condition()`` da ``StateTransition`` seja avaliada antes. Fora isso, ela será lida como a ordem de declaração. O valor padrão da prioridade é ``0``.

source: The ``State.OnLoad()`` is called only once on the Machine's life cycle. Meaning that any ``GetComponent<State>()`` (or, well... anything else) used inside of it will not be called multiple times.
pt_br: O ``State.OnLoad()`` é chamado apenas uma vez no ciclo de vida da Máquina. Significando que qualquer ``GetComponent<State>()`` (ou bem... qualquer lógica) dentro dele não será chamado múltiplas vezes.

source: The inspector
pt_br: O Inspetor

source: For a simple state, a simple name. Just that. You can set a Name for your state using Unity's inspector so you get some better visual feedback when taking a look at the state machine.
pt_br: Para um estado simples, um nome simples. E é isso. Você pode definir um Nome para o seu estado usando o Inspetor do Unity, então você terá feedback visual quando inspecionar a máquina de estados.

source: Set a name:
pt_br: Defina um nome:

source: State Name on inspector
pt_br: O nome do estado no inspetor

source: And see it in action while inpecting the StateMachine:
pt_br: A máquina de estados em ação exibindo o nome do estado atual:

source: State Name appearing on machine
pt_br: O nome do estado aparecendo no inspetor da máquina

source: That is it about creating a state for now. Let me show you a little about :ref:`how to use <using-the-state-machine-class>` our precious state machine.
pt_br: Isso é tudo sobre criar um estado por enquanto. Me deixa mostrar um pouco mais sobre :ref:`como usar <using-the-state-machine-class>` nossa máquina de estados maravilhosa.

source: Gabinho Waving
pt_br: Gabiniho Acenando
