Repository: indiegabo/iht-docs
Catalog: locales/*/LC_MESSAGES/fsm/how-to-use/using-the-state-machine.po
Languages: pt_br

source: Using the state machine
pt_br: Usando a Máquina de estados

source: Behold: THE STATE MACHINE!!!
pt_br: Contemple: A MÁQUINA DE ESTADOS!!!

source: Now that we know how to :ref:`setup an a actor <setting-up-an-actor-page>` and how to :ref:`create its states <creating-states-for-an-actor-page>` we can finally use the state machine.
pt_br: Agora que sabemos como :ref:`configurar um ator <setting-up-an-actor-page>` e como :ref:`criar seus estados <creating-states-for-an-actor-page>` podemos finalmente usar a Máquina de estados.

source: The :ref:`StateMachine <state-machine-class>` component, different from the actors and states, is a ready to use component. So you do not need to worry about creating any script for it. Just attach to a GameObject, attach states to the same GameObject, set a default state and you are good to go.
pt_br: O componente :ref:`StateMachine <state-machine-class>`, diferente dos atores e estados, é um componente pronto para uso. Então você não precisa se preocupar com criar scripts para user ele. Basta anexa-lo a um GameObject, anexar estados ao mesmo GameObject, definir um estado padrão e tudo certo!

source: Life Cycle
pt_br: Ciclo de vida

source: Let's take a look at the machine's Life Cycle:
pt_br: Vamos dar uma olhada no ciclo de vida da Máquina de estados:

source: Creating actor script from menu
pt_br: Criando script de ator a partir do menu

source: The ``StateMachine`` at its current version has 5 statuses: ``Off``, ``Loading``, ``Ready``, ``On`` and ``Paused``. They are declared as the enum ``IndieGabo.FSM.MachineStatus``.
pt_br: A ``StateMachine`` na versão atual tem 5 estados: ``Off``, ``Loading``, ``Ready``, ``On`` e ``Paused``. Eles são declarados como o enum ``IndieGabo.FSM.MachineStatus``.

source: I'd like to focus some attention on these steps:
pt_br: Eu gostaria de dar atenção aos seguintes passos:

source: The machine first ``StateMachine.status`` is ``MachineStatus.Off``.
pt_br: O primeiro ``StateMachine.status`` da máquina é ``MachineStatus.Off``.

source: Note that although our machine belongs to MonoBehaviour, it is the :ref:`Actor <actor-class>` wich sets up the machine. That is because the machine can only start operating when the actor is already awake. Once Awake, the actor calls ``StateMachine.SetUp()`` letting it know who its actor is.
pt_br: Note que, mesmo que a máquina pertença a MonoBehaviour, é o componente :ref:`Actor <actor-class>` que configura a máquina. Porque a máquina só pode começar a operar quando o ator já está acordado (Awake()). Uma vez acordado, o ator chama ``StateMachine.SetUp()``, informando a máquina quem ela deve tratar como o seu ator.

source: At this point the machine will change ``StateMachine.status`` from ``MachineStatus.Off`` to ``MachineStatus.Loading``.
pt_br: Nesse ponto, a máquina irá mudar ``StateMachine.status`` de ``MachineStatus.Off`` para ``MachineStatus.Loading``.

source: Here the machine will load up all the states attached into its GameObject and call subsequently all of the attached states ``State.OnLoad()`` followed by their ``State.SortTransitions()``. This last method makes sure transitions priorities get in order. This is the importancy of registering any :ref:`StateTranstion <state-transition-class>` of your state inside its ``State.OnLoad()``.
pt_br: Aqui, a máquina irá carregar todos os estados anexados ao seu GameObject e, para cada estado, chamar seu ``State.OnLoad()`` seguido do ``State.SortTransitions()``. Esse último método garante que as transições sejam ordenadas de acordo com suas prioridades. Vem daí a importância de registrar qualquer :ref:`StateTranstion <state-transition-class>` do seu estado dentro de seu ``State.OnLoad()``.

source: Now the machine will change ``StateMachine.status`` from ``MachineStatus.Loading`` to ``MachineStatus.Ready``.
pt_br: Agora, a máquina irá mudar ``StateMachine.status`` de ``MachineStatus.Loading`` para ``MachineStatus.Ready``.

source: Once ready, the machine will start by using ``StateMachine.ChangeState()`` to set the chosen default state (At the inspector. By you. Do not forget to do it).
pt_br: Uma vez pronta (ready), a máquina irá definir o ``StateMachine.defaultState`` como o o ``StateMachine.currentState``. Lembra que você deve definir o ``StateMachine.defaultState`` usando o inspetor da Unity.

source: The machine will finally change ``StateMachine.status`` from ``MachineStatus.Ready`` to ``MachineStatus.On`` and it is running!!! Hurray!
pt_br: A máquina irá finalmente transitar o ``StateMachine.status`` de ``MachineStatus.Ready`` para ``MachineStatus.On`` e está rodando!!! Boa!!

source: Tickers Methods and Machine Statuses
pt_br: Métodos Tickers e os status da Máquina

source: Once the machine has started, meaning its ``StateMachine.status`` is ``MachineStatus.On``, it will proceed passing forward the tickers methods (called inside the actor's "frame handlers") to the current state. As long as the ``StateMachine.status`` is ``MachineStatus.On`` it will do so.
pt_br: Uma vez que a máquina está ligada, significando que o ``StateMachine.status`` é ``MachineStatus.On``, ela irá chamar os Tickers do ``StateMachine.currentState`` de acordo com os "Frame Handlers" do ator. Enquanto o ``StateMachine.status`` for ``MachineStatus.On``, ela irá proceder desta forma.

source: If at any time you need to pause this behaviour, you can call ``StateMachine.Pause()`` and it will set ``StateMachine.status`` to ``MachineStatus.Paused``. Consequently, none of the tickers will be passed forward to the current state, therefore we can considered it as paused.
pt_br: Se em qualquer momento você precisar pausar este comportamento, você pode chamar ``StateMachine.Pause()`` e o ``StateMachine.status`` será definido como ``MachineStatus.Paused``. Desta forma, nenhum dos Tickers será passado para o ``StateMachine.currentState``, portanto, podemos considerar que a máquina está pausada.

source: To unpause, simply call ``StateMachine.Resume()`` and the ``StateMachine.status`` will be ``MachineStatus.On`` again.
pt_br: Para continuar, simplesmente chame ``StateMachine.Resume()`` e o ``StateMachine.status`` será definido como ``MachineStatus.On``.

source: Setting up the machine
pt_br: Configurando a máquina

source: You can simply create a single GameObject and attach the :ref:`StateMachine <state-machine-class>` component into it. Same goes for the :ref:`Actor <actor-class>`. Take a look:
pt_br: Você pode simplesmente criar um GameObject e anexar o :ref:`StateMachine <state-machine-class>` componente dentro dele. Isto também vale para o :ref:`Actor <actor-class>`. Veja:

source: But, as the actor's GameObject tends to have multiple components attached into it, for the sake of organization, i find more convenient to proceed creating an GameObject for the actor and use the machine as its child. Check it out:
pt_br: Mas, como o GameObject do ator tende a ter múltiplos componentes anexados a ele, para fins de organização, acho mais conveniente proceder criando um GameObject para o ator e usar a máquina em um GameObject filho do GameObject do ator.

source: Both strategies will work transparently for you. Just choose yours.
pt_br: Ambas as estratégias funcionarão transparentemente para você. Fique a vontade para escoher.

source: As you could observe, i've prepared a menu item for you to put a new state machine into your hierarchy. But if you wish to attach the :ref:`StateMachine <state-machine-class>` component into any GameObject, feel free to search for it using the "Add Component" inspector button.
pt_br: Como observamos, eu preparei um item de menu para você para colocar uma nova máquina de estado em sua hierarquia. Mas se você desejar anexar o componente :ref:`StateMachine <state-machine-class>` em qualquer GameObject, você pode procurar por ele usando o botão "Add Component" do inspetor.

source: All set!
pt_br: Tudo pronto!

source: Checkout the API documentation if you want to know more about these classes. For now, i'd say you have all the tools needed to start benefiting from the state machine!
pt_br: Confira a documentação da API se você quiser saber mais sobre essas classes. Por enquanto, eu acho que você tem tudo o que precisa para começar a beneficiar da máquina de estados!

source: HURRAY!! Go do something awesome and let me know about it!
pt_br: Boaaaa!! Agora é só fazer algo maravilhoso. Não esquece de me avisar!!!

source: Gabinho Waving
pt_br: Gabinho Acenando
