Repository: indiegabo/iht-docs
Catalog: sphinx/source/locales/*/LC_MESSAGES/fsm/welcome.po
Languages: pt_br

source: Much welcome to the IndieGabo's FSM!
pt_br: Muito boas vindas a FSM do IndieGabo!

source: This is a code driven FSM (Finate State Machine) solution for your Unity project.
pt_br: Esta é uma solução de FSM (Finite State Machine, ou, Máquina de estados Finita) baseada em código para seu projeto Unity.

source: What is a Finite State Machine?
pt_br: O que é uma Máquina de Estados Finita?

source: A Finate State Machine is a design pattern focused on dealing with entities that have multiple possible states.
pt_br: A Máquina de Estados Finita é um padrão de projeto focado em lidar com entidades que possuem vários estados possíveis.

source: Why this FSM?
pt_br: Porquê esta FSM?

source: Although we know Unity's Animator is a StateMachine it can get messy to use it as a functionality handler. This FSM helps you to organizing your code by holding the actors actions logic inside its respective state (we will talk about actors in a bit).
pt_br: Embora saibamos que o Animator da Unity é uma Máquina de Estados, ele pode ficar confuso para se usar como um gerenciador de ações de um modo geral. Esta FSM lhe ajuda a organizar seu código mantendo a lógica das ações dos atores dentro do seu respectivo estado (vamos falar sobre atores em alguns instantes).

source: Key pratical benefits of using this FSM:
pt_br: Benefícios práticos da utilização desta FSM:

source: Helps you keep things organized
pt_br: Te ajuda a manter tudo organizado

source: Once you understand how it works it'll save you hours of debugging since you will know exactly where each functionality is being executed
pt_br: Uma vez que você entenda como funciona, você vai economizar horas de depuração, pois você vai saber exatamente onde cada ação está sendo executada

source: Avoids overload of unecessary if statements since each state will only check for the conditions based on their registered transitions
pt_br: Evita sobrecarga de if statements, pois cada estado só verificará as condições baseadas nas transições registradas

source: You can get it running in like 5 minutes
pt_br: 5 minutos pra entender como funciona e colocar pra rodar

source: How it Works
pt_br: Como funciona

source: Take the concept of an ``actor`` being anything on your game wich performs several actions. The ``state machine`` then is setup to rule a given ``actor`` states of actions. The ``actor`` states must be registered into the ``state machine`` being that a ``state`` knows when to transition into another ``state`` under specific conditions.
pt_br: Conside um ``ator`` qualquer coisa no seu jogo que realiza várias ações. A ``máquina de estados`` então é configurada para regular os estados de ações de um ``ator``. Os estados do ``ator`` devem ser registrados na ``máquina de estados``, sendo que um ``estado`` sabe exatamente quando e para qual outro ``estado`` transitar sob condições específicas.

source: Also, for the usage of this FSM, we consider that a ``state`` isn't just some kind of status or definition. Our states **actually handles** what its ``actor`` performs while on a given ``state`` of actions.
pt_br: Além disso, para o uso desta FSM, consideramos que um ``estado`` não só é um tipo de status ou definição. Os estados **realmente executam** o que o ``ator`` deve fazer enquanto em um determinado ``estado`` de ações.

source: How to use
pt_br: Como usar

source: Gabinho Waving
pt_br: Gabinho Acenando
